const locale = {
	// 导航栏
	home: "الصفحة الأمامية",
	url_buy_twitter:'تويتر',
	url_buy_telegram:'برقية',
	index_SpacePi_Bscscan_t:'SpacePi Bscscan',
	index_SpacePi_Bscscan:'https://bscscan.com/token/0x69b14e8D3CEBfDD8196Bfe530954A0C226E5008E',

	// 选择语言
	selectLang: "اختر اللغة",

	// 首页
	happy_gd:'شركاء أكثر ودية',
	happy_text:"من أجل جعل SpacePi تحقق ابتكارات أكبر ، قررنا ترقية العقد إلى الآلية الأكثر أمانًا ، واعتماد نفس مستوى SHIBA Token. كن مطمئنًا ، أصولك آمنة ، وقد تم إصدار الرموز المميزة لمحفظتك. الرجاء إضافة عقد ترقية. سوف يتخلى العقد الذي تمت ترقيته عن جميع الأذونات ويغلق. عنوان العقد:",
	happy_text1:"سيكون SpacePi دائمًا معجبًا إيمانيًا بشبكة Pi Network!",
	happy_text2:"كل ما يفعله SpacePi الآن هو إثبات أن استمرار Pi Fans يستحق كل هذا العناء!",
	doge: "ما هو SpacePi?",
	only:"مزود الخدمة الشامل الوحيد في العالم من نوع رمز مميز لبروتوكول متعدد عبر سلسلة",
	introduce:"سيكون SpacePi هو الوحيد في مجال blockchain الذي يكسر الحواجز التقنية ويدمج العديد من الرموز المميزة للبروتوكول عبر السلاسل لأنواع مزودي الخدمة المتكاملة. المستقبل ينتمي إلى جميع مشغلات الأصول الرقمية في blockchain. دعونا نعمل معا لنشهد هذه اللحظة العظيمة!",
	text: [
		"ستنشئ SpacePi نظامًا بيئيًا رقميًا عالي المستوى غير مسبوق ، مما يوفر تجربة غمر رقمية بسيطة وفعالة كجوهر. يمنح قيمة تداول الرمز المميز ، ويسمح لمزيد من الأشخاص بالمشاركة في البناء البيئي لـ SpacePi ، ويخلق عالمًا ترفيهيًا بلا حدود ، ويربط المستخدمين في كل ركن من أركان العالم ، ويؤسس بيئة metaverse غير مركزية وغير موثوقة للغاية للمستخدمين العالميين.",
		"يتضمن SpacePi فئتين رئيسيتين من blockchain ، NFT و Metaverse. تقوم SpacePi ببناء منصة ألعاب واقع افتراضي لامركزية على الإنترنت تدمج الشخصيات والدعائم وقصص الحياة في تفاعلات اجتماعية افتراضية. يمكن للاعبين اللعب في العالم الافتراضي. لشراء الأسلحة والدروع والدعائم والأحجار الكريمة. شارك في مجموعات مختلفة لتطوير الألعاب الافتراضية والحياتية والحركية والألعاب الأخرى.",
		"سيتم تقديم جميع مزايا SpacePi في شكل الرمز المميز SpacePi. إن الواقع الافتراضي والواقع لـ SpacePi metaverse مترابطان للغاية ، وأصبح اقتصاد الحلقة المغلقة المرتبط بالمنصة مفتوحة المصدر الشكل النهائي للإنترنت."
	],
	tetxbu: 'ورق ابيض',
	tetxbu_url:'https://drive.google.com/file/d/1SM-Cf646IGJ1_NDHJsMHABOi9f12xtvo/view?usp=sharing',
	contractAddress: "",
	down: ['شراء SpacePi'],
	index_Liquidity_title:'السيولة مقفلة',
	index_Liquidity:'https://dxsale.app/app/v3_3/dxlockview?id=0&add=0x7f1b11a798273dA438b4b132dF1383d8387e73b4&type=lplock&chain=BSC',
	index_Goplus_title:'تدقيق Goplus',
	index_Goplus:'https://gopluslabs.io/token-security/56/0x69b14e8D3CEBfDD8196Bfe530954A0C226E5008E',
	index_SpacePi_title:'سعر SpacePi',
	index_SpacePi:[{
		title:'Dextools اتجاه',
	},{
		title:'Poocoin اتجاه',
	},{
		title:'Avedex اتجاه',
	},{
		title:'Msgsender',
	}],
	car: [{
		title: 'ما هو SpacePi؟',
		content: 'ستنشئ SpacePi نظامًا بيئيًا رقميًا عالي المستوى غير مسبوق ، مما يوفر تجربة غمر رقمية بسيطة وفعالة كجوهر.'
	}, {
		title: 'عالم SpacePi',
		content: 'يمنح قيمة تداول الرمز المميز ، ويسمح لمزيد من الأشخاص بالمشاركة في البناء البيئي لـ SpacePi ، ويخلق عالمًا ترفيهيًا بلا حدود ، ويربط المستخدمين في كل ركن من أركان العالم ، ويؤسس بيئة metaverse غير مركزية وغير موثوقة للغاية للمستخدمين العالميين.'
	}],
	station: {
		enter: 'نظام بيئي قوي SpacePi',
		title: 'في الواقع نحن نبني عالمًا رقميًا لم يسبق له مثيل.',
		text: [
			'أصبح الاقتصاد الرقمي نوعًا من الأصول المشروعة جديرًا بدراسة المستثمرين ، وقد انفجر بشكل كبير على المدى القصير.',
			'بناءً على وجهة النظر هذه ، أصبحت SpacePi أداة استثمار لشراء الأصول أو الخدمات الافتراضية في نظامها البيئي ، وسوف تنفجر بحيوية جديدة وقيمة غير مسبوقة مع تطبيق SpacePi. فيما يلي بعض النقاط الرئيسية في نظام SpacePi البيئي.'
		],
		c: [{
			title: 'رمز SpacePi',
			text: 'نوع جديد من الرموز المميزة للمرافق مدعوم من عدة سلاسل عامة ، يعمل كأساس في نظام SpacePi البيئي ، ويخدم تطبيقات متنوعة ، مع سيناريوهات تطبيق قوية'
		}, {
			title: 'مقدمة إلى SpacePi',
			text: 'يعتمد نظام SpacePi البيئي على WEB3.0 الثلاثية الأبعاد للإنترنت NFT والمكونات التقنية الأخرى ، وأصبح أقوى داعم تقني لمستخدمي الفضاء في الفضاء الافتراضي لـ Metaverse.'
		}, {
			title: 'SpacePi NFTs',
			text: 'يمكن أن تصبح الأصول الرقمية غير المتجانسة والقابلة للتحويل ذات الخصائص الفريدة مجموعة فنية أو دعامة لعبة في نظام SpacePi البيئي.'
		}, {
			title: 'SpacePi DAO',
			text: 'سيتم استخدام رمز SpacePi للتصويت في DAO في نظام SpacePi البيئي لضمان أن المشروع مستدام ذاتيًا ولا يحتوي على وحدة تحكم.'
		}, {
			title: 'SpacePi ميتافيرس',
			text: 'مساحة افتراضية ثلاثية الأبعاد Metaverse ثلاثية الأبعاد في نظام SpacePi البيئي'
		}, {
			title: 'سوق NFT',
			text: 'يتيح سوق SpacePi للمشاركين إدارة وتداول SpacePi NFTs ، والتي يتم تسعيرها في SpacePi كعملة التداول'
		}]
	},
	car1: [{
		text: 'Pi Network',
		title: 'SpacePi',
		trx: '10 BNB',
		usd: '3750 USD',
	}, {
		text: 'metauniverse',
		title: 'لعبة SpacePi',
		trx: '6.6 BNB',
		usd: '2390 USD',
	}, {
		text: 'إيلون ماسك',
		title: 'رائد فضاء',
		trx: '19 BNB',
		usd: '7030 USD',
	}],
	bsc_token:'0x69b14e8D3CEBfDD8196Bfe530954A0C226E5008E',
	hoce_token:'0x4bed97ff445c1dfd7b2c60aaede15df0f1c25ed3',
	tron_token:'TBRNdxuRCzoS9rXkHPDmoaVyKBuCwdTAYX',
	url_array:[{
		title:'SpacePi (bsc)',
		url:'https://PancakeSwap.finance/swap?inputCurrency=BNB&outputCurrency=0x69b14e8D3CEBfDD8196Bfe530954A0C226E5008E',
	},{
		title:'SpacePi (heco)',
		url:'https://ht.mdex.co/#/swap?inputCurrency=HT&outputCurrency=0x4bed97ff445c1dfd7b2c60aaede15df0f1c25ed3',
	},{
		title:'SpacePi (tron)',
		url:'https://sunswap.com/#/home?tokenAddress=TBRNdxuRCzoS9rXkHPDmoaVyKBuCwdTAYX&type=swap',
	}],

	// 路线图
	ROADMAP: "خريطة الطريق",
	ROADMAPtext: "هذه هي الخطة التي جعلت نظام SpacePi البيئي منذ الولادة وحتى العظمة.",
	Phase1: "المرحلة الأولى",
	Phase2: "المرحلة الثانية",
	r_title1: "واحد",
	r_title2: "اثنين",
	rt1_text1: "إطلاق الموقع الرسمي ونشر العقود الذكية",
	rt1_text2: "ابدأ عمليات وسائل التواصل الاجتماعي مثل Telegram و Twitter",
	rt1_text3: "افتح الجولة الأولى من عمليات الإنزال الجوي لأفراد المجتمع",
	rt1_text4: "3000 عضو برقية",
	rt1_text5: "فتح أرباح السيولة",
	rt1_text6: "مدرج في CoinMarketCap",
	rt1_text7: "مدرج في CoinGecko",
	rt1_text8: "تدقيق وكالة الطرف الثالث",
	rt1_text9: "بدء التسويق الشامل",
	rt1_text10: "الجولة الثانية من عمليات الإنزال الجوي للمجتمع",
	rt2_text1: "التعاون مع محافظ الطرف الثالث",
	rt2_text2: "ابدأ AMA مع مجتمع WSB",
	rt2_text3: "200 ألف + أعضاء Telegram",
	rt2_text4: "1000K + حاملي التوكن",
	rt2_text5: "ابدأ في تطوير SpacePiSwap",
	rt2_text6: "ابدأ في تطوير SpacePiNFT",
	rt2_text7: "ابدأ PiDAO",
	rt2_text8: "إطلاق بروتوكول معاملات التجميع عبر السلاسل SpacePiSwap",
	rt2_text9: "قم بإدراج أفضل CEXs في السوق",

	//社区通证
	Tokenomics: {
		text: 'المجتمع دائما يأتي أولا',
		title: 'بيئة رمزية عادلة',
		content: 'من أجل بناء شركة النقل الديمقراطي الخاصة بنا خارج الأرض ، يعتمد SpacePi على إصدار بيئي رمزي عادل ، بدون رمز خاص ، ولا ضريبة تطوير.',
		array: [{
			title: 'لا أحد',
			text: 'ضريبة التنمية'
		}, {
			title: 'لا أحد',
			text: 'رمز حرق'
		}, {
			title: '1000k+',
			text: 'مالك'
		}]
	},
	answers:{
		//顶部标题
		text:'SpacePi هو الرمز المميز الوحيد لبروتوكول متعدد السلاسل من نوع مزود الخدمة في العالم',
		//底部展开展示内容
		array:[{
			title:'1. ما هو metaverse الذي وصفه SpacePi؟',
			text:'الألعاب هي الشكل الأساسي للميتافيرس. من نموذج المنتج ، اللعبة هي النموذج الأولي للميتافيرس. نظرًا لكونه عالمًا افتراضيًا تم إنشاؤه بواسطة الأشخاص استنادًا إلى المحاكاة والامتداد والخيال الخيالي للواقع ، فإن الألعاب تشبه في شكل منتج إلى Metaverse. إذا كنت معتادًا على الكتاب أو فيلم Ready Player One ، فهذا مثال رائع على metaverse.',
		},{
			title:'2.هل ميتافيرس مسألة؟',
			text:'استنادًا إلى تكامل Web3.0 وتكنولوجيا الإنترنت الثلاثية الأبعاد و blockchain و NFT ، تتوافق القيم التي يقدمها مفهوم Metaverse مع القيم الأساسية للإنترنت. يعتقد SpacePi أن metaverse قد يكون الشكل النهائي للإنترنت. لذلك ، اتخذنا اللعبة كنقطة انطلاق وأنشأنا SpacePi ، وهي لعبة blockchain افتراضية تعتمد على NFT + metaverse ، مما يجعل الارتباط بين الواقع والافتراضية أكثر كفاءة ويثري تداول القيمة. أصبحت أهمية هذه المنصات الرقمية واضحة خلال الوباء العالمي الأخير.',
		},{
			title:'3. ما هو نظام SpacePi البيئي؟',
			text:'باعتبارها لعبة blockchain مدعومة بمفهوم NFT + Metaverse ، تتضمن SpacePi عدة أقسام أساسية من حيث البناء البيئي للمنصة. NFT نظام اللعبة Metaverse لعبة البيئة SpacePi Exchange',
		},{
			title:'4- ماذا يمكننا أن نفعل في SpacePi metaverse؟',
			text:'يجمع SpacePi Token ، المشار إليه باسم SpacePi ، بين فئتي blockchain الرئيسيتين لـ NFT و Metaverse ، بهدف إنشاء منصة ألعاب واقع افتراضي لامركزية عبر الإنترنت تدمج الشخصيات والدعائم وقصص الحياة في تفاعل اجتماعي افتراضي. يمكن شراء الأسلحة والدروع والدعائم والأحجار الكريمة في العالم الافتراضي. شارك في مجموعات مختلفة لتطوير الألعاب الافتراضية والحياتية والحركية والألعاب الأخرى. على هذا النحو ، فإن SpacePi هو المشروع الأول والوحيد عبر مجالات metaverse و NFT',
		},{
			title:'5. كيف تربح المال في SpacePi Metaverse؟',
			text:'يمكن لـ SpacePi أيضًا دعم مطوري الطرف الثالث في برمجة تطبيقات الألعاب اللامركزية وتصحيحها وإصدارها وتطبيقات ألعاب الهندسة الهجينة لبيئة blockchain. في الوقت نفسه ، تدمج SpacePi نظام حساب المستخدم الموزع المستند إلى blockchain ، وتداول الأصول الرقمية NFT والمحفظة ، والتي يمكن أن تحقق التخزين الدائم خارج السلسلة والاستخدام المتقاطع لأصول اللعبة داخل التطبيق NFT.',
		},{
			title:'6. مطور SpacePi؟',
			text:'تم تطوير SpacePi Metaverse بالاشتراك مع مطورين مستقلين حول العالم ، مع خبرة لا مثيل لها تقريبًا وقدرة على توجيه وإدارة وتعزيز المشاريع المتعلقة بالعملات المشفرة. معًا ، يشكلون فريقًا قويًا مع مجموعة من المؤيدين المتشابهين في التفكير الذين لديهم ثقة وشغف لرؤية SpacePi metaverse ، وهي مغامرة جديدة في عالم metaverse.',
		},{
			title:'7- كيف يمكنني تقديم المزيد من المساعدة؟',
			text:'بسبب اللامركزية الكاملة ، سيتطلب SpacePi metaverse مجتمعًا أكبر بكثير للوصول إلى أهدافنا ، فنحن نرحب بك للانضمام إلى SpacePi',
		}],
	},
	//社区
	Community:{
		title:'انضم إلى مجتمع SpacePi العالمي',
		text:"سيكون SpacePi هو الوحيد في مجال blockchain الذي يكسر الحواجز التقنية ويدمج العديد من الرموز المميزة للبروتوكول عبر السلاسل لأنواع مزودي الخدمة المتكاملة. المستقبل ينتمي إلى جميع مشغلات الأصول الرقمية في blockchain. دعونا نعمل معا لنشهد هذه اللحظة العظيمة!",
		buttext:'انضم إلينا',
		buttext_url:'https://t.me/SpacePi_com',
	},

	// 底部
	footer1: "إذا كان لديك أي سؤال ، يرجى الاتصال بنا",
	footer2: "حقوق النشر © 2021-2022 SpacePi. كل الحقوق محفوظة",
	footer_twitter_url:'https://twitter.com/SpacePi_Com',
	footer_telegram_url:'https://t.me/SpacePi_com',
	footer_discord_url:'https://t.me/SpacePi_com',
	footer_reddit_url:'https://t.me/SpacePi_com',
	footer_github_url:'https://github.com/SpacePiCom',
	footer_medium_url:'https://medium.com/@spacepi',
	footer_copy_url:'https://t.me/SpacePi_com',


	//友情合作商页面
	partners_title:'سيكون SpacePi دائمًا معجبًا إيمانيًا بشبكة Pi Network!',
	partners_text:'كل ما تفعله SpacePi الآن هو إثبات أن استمرار Pi Fans يستحق كل هذا العناء! نرحب بالمزيد من المنصات والمؤسسات للتعاون مع SpacePi ، البريد الإلكتروني الرسمي للاتصال: pi@space-pi.com'
};

export default locale;
